KazeFx2/stm32_tft_mini_game/SYSTEM/sys/sys.h
#ifndef __SYS_H
#define __SYS_H
#include "stm32f10x.h"
//////////////////////////////////////////////////////////////////////////////////
// 本程序只供学习使用，未经作者许可，不得用于其它任何用途
// ALIENTEK STM32开发板
// 正点原子@ALIENTEK
// 技术论坛:www.openedv.com
// 修改日期:2012/8/18
// 版本：V1.7
// 版权所有，盗版必究。
// Copyright(C) 广州市星翼电子科技有限公司 2009-2019
// All rights reserved
//////////////////////////////////////////////////////////////////////////////////

// 0,不支持ucos
// 1,支持ucos
#define SYSTEM_SUPPORT_OS 0 // 定义系统文件夹是否支持UCOS

// 位带操作,实现51类似的GPIO控制功能
// 具体实现思想,参考<<CM3权威指南>>第五章(87页~92页).
// IO口操作宏定义
#define BITBAND(addr, bitnum) ((addr & 0xF0000000) + 0x2000000 + ((addr & 0xFFFFF) << 5) + (bitnum << 2))
#define MEM_ADDR(addr) *((volatile unsigned long *)(addr))
#define BIT_ADDR(addr, bitnum) MEM_ADDR(BITBAND(addr, bitnum))
// IO口地址映射
#define GPIOA_ODR_Addr (GPIOA_BASE + 12) // 0x4001080C
#define GPIOB_ODR_Addr (GPIOB_BASE + 12) // 0x40010C0C
#define GPIOC_ODR_Addr (GPIOC_BASE + 12) // 0x4001100C
#define GPIOD_ODR_Addr (GPIOD_BASE + 12) // 0x4001140C
#define GPIOE_ODR_Addr (GPIOE_BASE + 12) // 0x4001180C
#define GPIOF_ODR_Addr (GPIOF_BASE + 12) // 0x40011A0C
#define GPIOG_ODR_Addr (GPIOG_BASE + 12) // 0x40011E0C

#define GPIOA_IDR_Addr (GPIOA_BASE + 8) // 0x40010808
#define GPIOB_IDR_Addr (GPIOB_BASE + 8) // 0x40010C08
#define GPIOC_IDR_Addr (GPIOC_BASE + 8) // 0x40011008
#define GPIOD_IDR_Addr (GPIOD_BASE + 8) // 0x40011408
#define GPIOE_IDR_Addr (GPIOE_BASE + 8) // 0x40011808
#define GPIOF_IDR_Addr (GPIOF_BASE + 8) // 0x40011A08
#define GPIOG_IDR_Addr (GPIOG_BASE + 8) // 0x40011E08

// IO口操作,只对单一的IO口!
// 确保n的值小于16!
#define PAout(n) BIT_ADDR(GPIOA_ODR_Addr, n) // 输出
#define PAin(n) BIT_ADDR(GPIOA_IDR_Addr, n)  // 输入

#define PBout(n) BIT_ADDR(GPIOB_ODR_Addr, n) // 输出
#define PBin(n) BIT_ADDR(GPIOB_IDR_Addr, n)  // 输入

#define PCout(n) BIT_ADDR(GPIOC_ODR_Addr, n) // 输出
#define PCin(n) BIT_ADDR(GPIOC_IDR_Addr, n)  // 输入

#define PDout(n) BIT_ADDR(GPIOD_ODR_Addr, n) // 输出
#define PDin(n) BIT_ADDR(GPIOD_IDR_Addr, n)  // 输入

#define PEout(n) BIT_ADDR(GPIOE_ODR_Addr, n) // 输出
#define PEin(n) BIT_ADDR(GPIOE_IDR_Addr, n)  // 输入

#define PFout(n) BIT_ADDR(GPIOF_ODR_Addr, n) // 输出
#define PFin(n) BIT_ADDR(GPIOF_IDR_Addr, n)  // 输入

#define PGout(n) BIT_ADDR(GPIOG_ODR_Addr, n) // 输出
#define PGin(n) BIT_ADDR(GPIOG_IDR_Addr, n)  // 输入

#define PAoutA(n) ((volatile unsigned long *)BITBAND(GPIOA_ODR_Addr, n)) // 输出
#define PAinA(n) ((volatile unsigned long *)BITBAND(GPIOA_IDR_Addr, n))  // 输入

#define PBoutA(n) ((volatile unsigned long *)BITBAND(GPIOB_ODR_Addr, n)) // 输出
#define PBinA(n) ((volatile unsigned long *)BITBAND(GPIOB_IDR_Addr, n))  // 输入

#define PCoutA(n) ((volatile unsigned long *)BITBAND(GPIOC_ODR_Addr, n)) // 输出
#define PCinA(n) ((volatile unsigned long *)BITBAND(GPIOC_IDR_Addr, n))  // 输入

#define PDoutA(n) ((volatile unsigned long *)BITBAND(GPIOD_ODR_Addr, n)) // 输出
#define PDinA(n) ((volatile unsigned long *)BITBAND(GPIOD_IDR_Addr, n))  // 输入

#define PEoutA(n) ((volatile unsigned long *)BITBAND(GPIOE_ODR_Addr, n)) // 输出
#define PEinA(n) ((volatile unsigned long *)BITBAND(GPIOE_IDR_Addr, n))  // 输入

#define PFoutA(n) ((volatile unsigned long *)BITBAND(GPIOF_ODR_Addr, n)) // 输出
#define PFinA(n) ((volatile unsigned long *)BITBAND(GPIOF_IDR_Addr, n))  // 输入

#define PGoutA(n) ((volatile unsigned long *)BITBAND(GPIOG_ODR_Addr, n)) // 输出
#define PGinA(n) ((volatile unsigned long *)BITBAND(GPIOG_IDR_Addr, n))  // 输入

// 以下为汇编函数
void WFI_SET(void);      // 执行WFI指令
void INTX_DISABLE(void); // 关闭所有中断
void INTX_ENABLE(void);  // 开启所有中断
void MSR_MSP(u32 addr);  // 设置堆栈地址

#endif
